#pragma once
#include <cstddef>
#include <cstdint>
#include <memory>
#include <optional>
#include <string>
#include <type_traits>
#include <unordered_map>
#include <variant>
#include <vector>

/**
 * Виды токенов, используемых транслятором
 *
 * \note Для всех видов токенов стандартное написание в upper case, кроме тех
 * токенов, название которых совпадает с лексемой в коде. В таких случаях в
 * перечислении данный токен пишется строчными буквами с первой заглавной
 * буквой.
 *
 * \warning _count - специальный элемент, нужный для нахождения количества
 * элементов в перечислении за время компиляции. Если вы хотите добавить новый
 * элемент в enum, добавляйте его перед _count. _count должен быть всегда
 * последним. Также не используйте _count в коде.
 */
enum class TokenType : uint8_t {
  For,       //!< Слово "for"  +
  LPAR,      //!< Символ "("  +
  NAME,      //!< Токен названия переменной
  WORD,      //!< Токен слова, которое выводится командой print
  NUM,       //!< Токен числа
  COMP,      //!< Токен операции сравнения
  UNARY_OP,  //!< Токен унарной операции
  ASSIGN_OP, //!< Символ "="  +
  Print,     //!< Слово "print"
  QUOTE,     //!< Символ """  +
  RPAR,      //!< Символ ")"   +
  SEMICOL,   //!< Символ ";"  +
  END,       //!< Конец разбираемого предложения. Этот тип токена соответствует
       //!< лексеме '$'. Хотя ее и нет в языке, она используется транслятором
       //!< для обнаружения конца разбираемого предложения
  _count
};

/**
 * Виды нетерминалов
 *
 * \warning _count - специальный элемент, нужный для нахождения количества
 * элементов в перечислении за время компиляции. Если вы хотите добавить новый
 * элемент в enum, добавляйте его перед _count. _count должен быть всегда
 * последним. Также не используйте _count в коде.
 */
enum class NonTerm : uint8_t {
  STAT = 0,
  FOR_EXPR,
  INIT,
  COND,
  OPERAND,
  ACTION_STR,
  CMD,
  _count
};

/**
 * Получить численное представление элемента перечисления
 *
 * Мотивация определения данной функции следующая: в таблицах Goto и Action (см.
 * класс Parser) необходимо получать элементы таблиц по элементу перечисления
 * (что-то в духе Action[3][TokenType::For]). Однако современные enum class не
 * допускают неявного приведения к их underlying_type. Поэтому есть эта функция.
 */
template <typename Enum> constexpr std::underlying_type_t<Enum> idx(Enum type) {
  return static_cast<std::underlying_type_t<Enum>>(type);
}

/**
 * Получить размер перечисления на этапе компиляции
 *
 * \tparam Enum
 *   - Обязан быть перечислением
 *   - Обязан иметь элемент _count
 *   - Элемент _count обязан стоять на последнем месте
 *
 * \todo sfinae или концепты
 */
template <typename Enum> constexpr std::underlying_type_t<Enum> getEnumSize() {
  return idx(Enum::_count);
}

using Lexem = std::string; //!< Тип лексемы

/**
 * Тип, обозначающий токен
 *
 * Поля класса Token обозначают следующее:
 * - first - тип токена
 * - second - лексема. По этой лексеме можно найти информацию о токене в таблице
 * символов
 */
using Token = std::pair<TokenType, Lexem>;

/**
 * Значение токена в таблице символов
 */
struct Symbol {
  int32_t scope; //!< Область видимости переменной.
                 //!< Число означает номер цикла в выражении
                 //!< -1 означает, что переменная не инициализирована
  Token init;    //!< Токен, инициализирующий переменную.

  /**
   * Адрес символа во внутреннем представлении транслятора.
   *
   * Транслятор выделяет массив целых чисел, в котором хранятся значения
   * переменных. ind - это индекс в этом массиве.
   */
  int ind;
};

/**
 * Тип таблицы символов
 */
using SymbolTable = std::unordered_map<Lexem, Symbol>;

/**
 * Таблица символов, используемая частями транслятора
 */
extern SymbolTable symbolTable;

/**
 * Простой узел дерева разбора
 */
struct ParseNode {
  std::vector<std::unique_ptr<ParseNode>> childs;
  std::variant<NonTerm, Token> tok{};
};
